let str = "Hello, World!";
// это переменная, которая новая у которого блочная видимость. Она может быть использована только в пределах блока, в котором она была объявлена.
var num = 42;
// это переменная, которая имеет функциональную видимость. Она может быть использована в пределах функции, в которой она была объявлена, или глобально, если объявлена вне функции.Она старая и не рекомендуется к использованию.
const name = "John";
//это константа и значение нельзя поменять.





let num = 25;

//  1. число

let str1 = "Алексей";
// 2. текст

let bool = true;
// 3. правда или ложь


let unef = undefined; 
// 4. значение не определено.

let nullt = null;
// 5. пустое значение .

let user = {
    name: "Алексей",
    age: 25
};
// 6. хранит данные в виде ключ-значение.


